RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_dma.c
/*! Parameter valid check for DMA reconfig count mode. */
#define IS_DMA_RC_CNT_MODE(mode)                                                \
(   ((mode) == DMA_RC_CNT_FIX)              ||                                  \
    ((mode) == DMA_RC_CNT_SRC)              ||                                  \
    ((mode) == DMA_RC_CNT_DEST))

/*! Parameter valid check for DMA reconfig destination address mode. */
#define IS_DMA_RC_DA_MODE(mode)                                                 \
(   ((mode) == DMA_RC_DA_FIX)               ||                                  \
    ((mode) == DMA_RC_DA_NS )               ||                                  \
    ((mode) == DMA_RC_DA_RPT))

/*! Parameter valid check for DMA reconfig source address mode. */
#define IS_DMA_RC_SA_MODE(mode)                                                 \
(   ((mode) == DMA_RC_SA_FIX)               ||                                  \
    ((mode) == DMA_RC_SA_NS )               ||                                  \
    ((mode) == DMA_RC_SA_RPT))

/*! Parameter valid check for DMA common trigger config. */
#define IS_DMA_COM_TRIG(trig)                                                   \
(   ((trig) != 0x00UL)                      &&                                  \
    (((trig) | DMA_COM_TRIG_MASK) == DMA_COM_TRIG_MASK))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup DMA_Global_Functions DMA Global Functions
 * @{
 */

/**
 * @brief  DMA global function config.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] enNewState The function new state.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void DMA_Cmd(M4_DMA_TypeDef *DMAx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    /* Global setting, Enable or Disable DMA */
    WRITE_REG32(DMAx->EN, enNewState);
}

/**
 * @brief  DMA error IRQ function config.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u32ErrInt DMA error IRQ flag.
 *   @arg  DMA_REQ_ERR_CH0.
 *   @arg  DMA_REQ_ERR_CH1.
 *   @arg  DMA_REQ_ERR_CH2.
 *   @arg  DMA_REQ_ERR_CH3.
 *   @arg  DMA_REQ_ERR_CH4.
 *   @arg  DMA_REQ_ERR_CH5.
 *   @arg  DMA_REQ_ERR_CH6.
 *   @arg  DMA_REQ_ERR_CH7.
 *   @arg  DMA_TRANS_ERR_CH0.
 *   @arg  DMA_TRANS_ERR_CH1.
 *   @arg  DMA_TRANS_ERR_CH2.
 *   @arg  DMA_TRANS_ERR_CH3.
 *   @arg  DMA_TRANS_ERR_CH4.
 *   @arg  DMA_TRANS_ERR_CH5.
 *   @arg  DMA_TRANS_ERR_CH6.
 *   @arg  DMA_TRANS_ERR_CH7.
 * @param  [in] enNewState The function new state.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void DMA_ErrIntCmd(M4_DMA_TypeDef *DMAx, uint32_t u32ErrInt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_ERR_INT(u32ErrInt));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Disable == enNewState)
    {
        SET_REG32_BIT(DMAx->INTMASK0, u32ErrInt);
    }
    else
    {
        CLEAR_REG32_BIT(DMAx->INTMASK0, u32ErrInt);
    }
}

/**
 * @brief  Get DMA error IRQ status.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u32ErrInt DMA error IRQ flag.
 *   @arg  DMA_REQ_ERR_CH0.
 *   @arg  DMA_REQ_ERR_CH1.
 *   @arg  DMA_REQ_ERR_CH2.
 *   @arg  DMA_REQ_ERR_CH3.
 *   @arg  DMA_REQ_ERR_CH4.
 *   @arg  DMA_REQ_ERR_CH5.
 *   @arg  DMA_REQ_ERR_CH6.
 *   @arg  DMA_REQ_ERR_CH7.
 *   @arg  DMA_TRANS_ERR_CH0.
 *   @arg  DMA_TRANS_ERR_CH1.
 *   @arg  DMA_TRANS_ERR_CH2.
 *   @arg  DMA_TRANS_ERR_CH3.
 *   @arg  DMA_TRANS_ERR_CH4.
 *   @arg  DMA_TRANS_ERR_CH5.
 *   @arg  DMA_TRANS_ERR_CH6.
 *   @arg  DMA_TRANS_ERR_CH7.
 * @retval en_flag_status_t
 */
en_flag_status_t DMA_GetErrIntStatus(const M4_DMA_TypeDef *DMAx, uint32_t u32ErrInt)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_ERR_INT(u32ErrInt));

    return (READ_REG32_BIT(DMAx->INTSTAT0, u32ErrInt) ? Set : Reset);
}

/**
 * @brief  Clear DMA error IRQ status.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u32ErrInt DMA error IRQ flag.
 *   @arg  DMA_REQ_ERR_CH0.
 *   @arg  DMA_REQ_ERR_CH1.
 *   @arg  DMA_REQ_ERR_CH2.
 *   @arg  DMA_REQ_ERR_CH3.
 *   @arg  DMA_REQ_ERR_CH4.
 *   @arg  DMA_REQ_ERR_CH5.
 *   @arg  DMA_REQ_ERR_CH6.
 *   @arg  DMA_REQ_ERR_CH7.
 *   @arg  DMA_TRANS_ERR_CH0.
 *   @arg  DMA_TRANS_ERR_CH1.
 *   @arg  DMA_TRANS_ERR_CH2.
 *   @arg  DMA_TRANS_ERR_CH3.
 *   @arg  DMA_TRANS_ERR_CH4.
 *   @arg  DMA_TRANS_ERR_CH5.
 *   @arg  DMA_TRANS_ERR_CH6.
 *   @arg  DMA_TRANS_ERR_CH7.
 * @retval None
 */
void DMA_ClearErrIntStatus(M4_DMA_TypeDef *DMAx, uint32_t u32ErrInt)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_ERR_INT(u32ErrInt));

    SET_REG32_BIT(DMAx->INTCLR0, u32ErrInt);
}

/**
 * @brief  DMA transfer IRQ function config.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u32TransInt DMA transfer IRQ flag.
 *   @arg  DMA_BTC_INT_CH0
 *   @arg  DMA_BTC_INT_CH1
 *   @arg  DMA_BTC_INT_CH2
 *   @arg  DMA_BTC_INT_CH3
 *   @arg  DMA_BTC_INT_CH4
 *   @arg  DMA_BTC_INT_CH5
 *   @arg  DMA_BTC_INT_CH6
 *   @arg  DMA_BTC_INT_CH7
 *   @arg  DMA_TC_INT_CH0
 *   @arg  DMA_TC_INT_CH1
 *   @arg  DMA_TC_INT_CH2
 *   @arg  DMA_TC_INT_CH3
 *   @arg  DMA_TC_INT_CH4
 *   @arg  DMA_TC_INT_CH5
 *   @arg  DMA_TC_INT_CH6
 *   @arg  DMA_TC_INT_CH7
 * @param  [in] enNewState The function new state.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void DMA_TransIntCmd(M4_DMA_TypeDef *DMAx, uint32_t u32TransInt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_TRANS_INT(u32TransInt));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Disable == enNewState)
    {
        SET_REG32_BIT(DMAx->INTMASK1, u32TransInt);
    }
    else
    {
        CLEAR_REG32_BIT(DMAx->INTMASK1, u32TransInt);
    }
}

/**
 * @brief  Get DMA transfer IRQ status.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u32TransInt DMA transfer IRQ flag.
 *   @arg  DMA_BTC_INT_CH0
 *   @arg  DMA_BTC_INT_CH1
 *   @arg  DMA_BTC_INT_CH2
 *   @arg  DMA_BTC_INT_CH3
 *   @arg  DMA_BTC_INT_CH4
 *   @arg  DMA_BTC_INT_CH5
 *   @arg  DMA_BTC_INT_CH6
 *   @arg  DMA_BTC_INT_CH7
 *   @arg  DMA_TC_INT_CH0
 *   @arg  DMA_TC_INT_CH1
 *   @arg  DMA_TC_INT_CH2
 *   @arg  DMA_TC_INT_CH3
 *   @arg  DMA_TC_INT_CH4
 *   @arg  DMA_TC_INT_CH5
 *   @arg  DMA_TC_INT_CH6
 *   @arg  DMA_TC_INT_CH7
 * @retval en_flag_status_t
 */
en_flag_status_t DMA_GetTransIntStatus(const M4_DMA_TypeDef *DMAx, uint32_t u32TransInt)
{
    DDL_ASSERT(IS_DMA_TRANS_INT(u32TransInt));
    return (READ_REG32_BIT(DMAx->INTSTAT1, u32TransInt) ? Set : Reset);
}

/**
 * @brief  Clear DMA transfer IRQ status.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u32TransInt DMA transfer IRQ flag.
 *   @arg  DMA_BTC_INT_CH0
 *   @arg  DMA_BTC_INT_CH1
 *   @arg  DMA_BTC_INT_CH2
 *   @arg  DMA_BTC_INT_CH3
 *   @arg  DMA_BTC_INT_CH4
 *   @arg  DMA_BTC_INT_CH5
 *   @arg  DMA_BTC_INT_CH6
 *   @arg  DMA_BTC_INT_CH7
 *   @arg  DMA_TC_INT_CH0
 *   @arg  DMA_TC_INT_CH1
 *   @arg  DMA_TC_INT_CH2
 *   @arg  DMA_TC_INT_CH3
 *   @arg  DMA_TC_INT_CH4
 *   @arg  DMA_TC_INT_CH5
 *   @arg  DMA_TC_INT_CH6
 *   @arg  DMA_TC_INT_CH7
 * @retval None
 */
void DMA_ClearTransIntStatus(M4_DMA_TypeDef *DMAx, uint32_t u32TransInt)
{
    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_TRANS_INT(u32TransInt));

