RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_dma.c
    if (NULL == pstcDmaInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcDmaInit->u32IntEn       = DMA_INT_ENABLE;
        pstcDmaInit->u32SrcAddr     = 0x00UL;
        pstcDmaInit->u32DestAddr    = 0x00UL;
        pstcDmaInit->u32DataWidth   = DMA_DATAWIDTH_8BIT;
        pstcDmaInit->u32BlockSize   = 0x00UL;
        pstcDmaInit->u32TransCnt    = 0x01UL;
        pstcDmaInit->u32SrcInc      = DMA_SRC_ADDR_FIX;
        pstcDmaInit->u32DestInc     = DMA_DEST_ADDR_FIX;
    }
    return enRet;
}

/**
 * @brief  DMA basic function initialize.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] pstcDmaInit DMA config structure.
 *   @arg  u32IntEn         DMA interrupt enable or disable.
 *   @arg  u32SrcAddr       DMA source address.
 *   @arg  u32DestAddr      DMA destination address.
 *   @arg  u32DataWidth     DMA data width.
 *   @arg  u32BlockSize     DMA block size.
 *   @arg  u32TransferCnt   DMA transfer count.
 *   @arg  u32SrcInc        DMA source address direction.
 *   @arg  u32DestInc       DMA destination address direction.
 * @retval Ok: DMA basic function initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t DMA_Init(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, const stc_dma_init_t *pstcDmaInit)
{
    en_result_t enRet = Ok;
    __IO uint32_t *CHCTLx;

    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    if (NULL == pstcDmaInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_DMA_INT_FUNC(pstcDmaInit->u32IntEn));
        DDL_ASSERT(IS_DMA_DATA_WIDTH(pstcDmaInit->u32DataWidth));
        DDL_ASSERT(IS_DMA_SADDR_MODE(pstcDmaInit->u32SrcInc));
        DDL_ASSERT(IS_DMA_DADDR_MODE(pstcDmaInit->u32DestInc));
        DDL_ASSERT(IS_DMA_BLKSZ(pstcDmaInit->u32BlockSize));

        WRITE_REG32(DMA_CH_REG(DMAx->SAR0, u8Ch), pstcDmaInit->u32SrcAddr);
        WRITE_REG32(DMA_CH_REG(DMAx->DAR0, u8Ch), pstcDmaInit->u32DestAddr);
        WRITE_REG32(DMA_CH_REG(DMAx->DTCTL0, u8Ch), (pstcDmaInit->u32BlockSize| \
            (pstcDmaInit->u32TransCnt << DMA_DTCTL_CNT_POS)));

        CHCTLx = &DMA_CH_REG(DMAx->CHCTL0, u8Ch);
        MODIFY_REG32(*CHCTLx,                                                   \
            (DMA_CHCTL_SINC | DMA_CHCTL_DINC | DMA_CHCTL_HSIZE | DMA_CHCTL_IE), \
            (pstcDmaInit->u32IntEn | pstcDmaInit->u32DataWidth |                \
            pstcDmaInit->u32SrcInc | pstcDmaInit->u32DestInc));
    }
    return enRet;
}

/**
 * @brief  Initialize DMA repeat mode config structure.
 *          Fill each pstcDmaInit with default value
 * @param  [in] pstcDmaRptInit Pointer to a stc_dma_rpt_init_t structure that
 *                            contains configuration information.
 * @retval Ok: DMA repeat mode config structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t DMA_RepeatStructInit(stc_dma_rpt_init_t *pstcDmaRptInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcDmaRptInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcDmaRptInit->u32SrcRptEn     = DMA_SRC_RPT_DISABLE;
        pstcDmaRptInit->u32SrcRptSize   = 0x00UL;
        pstcDmaRptInit->u32DestRptEn    = DMA_DEST_RPT_DISABLE;
        pstcDmaRptInit->u32DestRptSize  = 0x00UL;
    }
    return enRet;
}

/**
 * @brief  DMA repeat mode initialize.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] pstcDmaRptInit DMA repeat mode config structure.
 *   @arg  u32SrcRptEn      DMA source repeat enable or disable.
 *   @arg  u32SrcRptSize    DMA source repeat size.
 *   @arg  u32DestRptEn     DMA destination repeat enable or disable.
 *   @arg  u32DestRptSize   DMA destination repeat size.
 * @retval Ok: DMA repeat function initialize successful
 *         ErrorInvalidParameter: NULL pointer
 * @note Call this function after DMA_Init();
 */
en_result_t DMA_RepeatInit(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, const stc_dma_rpt_init_t *pstcDmaRptInit)
{
    en_result_t enRet = Ok;
    __IO uint32_t *CHCTLx;

    DDL_ASSERT(IS_DMA_UNIT(DMAx));
    DDL_ASSERT(IS_DMA_CH(u8Ch));

    if (NULL == pstcDmaRptInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_DMA_SRC_RPT(pstcDmaRptInit->u32SrcRptEn));
        DDL_ASSERT(IS_DMA_DEST_RPT(pstcDmaRptInit->u32DestRptEn));
        DDL_ASSERT(IS_DMA_BLKSZ(pstcDmaRptInit->u32DestRptSize));
        DDL_ASSERT(IS_DMA_BLKSZ(pstcDmaRptInit->u32SrcRptSize));

        CHCTLx = &DMA_CH_REG(DMAx->CHCTL0, u8Ch);
        MODIFY_REG32(*CHCTLx,                                                   \
            (DMA_CHCTL_SRTPEN | DMA_CHCTL_DRPTEN),                              \
            (pstcDmaRptInit->u32SrcRptEn | pstcDmaRptInit->u32DestRptEn));

        WRITE_REG32(DMA_CH_REG(DMAx->RPT0, u8Ch),                               \
            ((pstcDmaRptInit->u32DestRptSize << DMA_RPT_DRPT_POS) |             \
            pstcDmaRptInit->u32SrcRptSize));
    }
    return enRet;
}

/**
 * @brief  Initialize DMA non-sequence mode config structure.
 *          Fill each pstcDmaInit with default value
 * @param  [in] pstcDmaNonSeqInit Pointer to a stc_dma_nonseq_init_t structure that
 *                            contains configuration information.
 * @retval Ok: DMA non-sequence mode structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t DMA_NonSeqStructInit(stc_dma_nonseq_init_t *pstcDmaNonSeqInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcDmaNonSeqInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcDmaNonSeqInit->u32SrcNonSeqEn   = DMA_SRC_NS_DISABLE;
        pstcDmaNonSeqInit->u32SrcNonSeqCnt  = 0x00UL;
        pstcDmaNonSeqInit->u32SrcNonSeqOfs  = 0x00UL;
        pstcDmaNonSeqInit->u32DestNonSeqEn  = DMA_DEST_NS_DISABLE;
        pstcDmaNonSeqInit->u32DestNonSeqCnt = 0x00UL;
        pstcDmaNonSeqInit->u32DestNonSeqOfs = 0x00UL;
    }
    return enRet;
}

/**
 * @brief  DMA non-sequence mode initialize.
 * @param  [in] DMAx DMA unit instance.
 *   @arg  M4_DMA1 Unit1.
 *   @arg  M4_DMA2 Unit2.
 * @param  [in] u8Ch DMA channel.
 *   @arg  DMA_CH0.
 *   @arg  DMA_CH1.
 *   @arg  DMA_CH2.
 *   @arg  DMA_CH3.
 *   @arg  DMA_CH4.
 *   @arg  DMA_CH5.
 *   @arg  DMA_CH6.
 *   @arg  DMA_CH7.
 * @param  [in] pstcDmaNonSeqInit DMA non-sequence mode config structure.
 *   @arg  u32SrcNonSeqEn   DMA source non-sequence enable or disable.
 *   @arg  u32SrcNonSeqCnt  DMA source non-sequence count.
 *   @arg  u32SrcNonSeqOfs  DMA source non-sequence offset.
 *   @arg  u32DestNonSeqEn  DMA destination non-sequence enable or disable.
 *   @arg  u32DestNonSeqCnt DMA destination non-sequence count.
 *   @arg  u32DestNonSeqOfs DMA destination non-sequence offset.
 * @retval Ok: DMA non-sequence function initialize successful
 *         ErrorInvalidParameter: NULL pointer
 * @note Call this function after DMA_Init();
 */
en_result_t DMA_NonSeqInit(M4_DMA_TypeDef *DMAx, uint8_t u8Ch, const stc_dma_nonseq_init_t *pstcDmaNonSeqInit)
{
    en_result_t enRet = Ok;
    __IO uint32_t *CHCTLx;

